In [1]:
import pandas as pd

## 예제 6-4 데이터병합 활용

In [2]:
korea_2012 = pd.read_excel('korea_pop_2012.xls',encoding='cp949') #인코딩 뒤에 index_col=0를 붙이면 0을 인덱스로 만든다.

In [3]:
korea_2012.head()

  Unnamed: 0    2008    2009    2010    2011    2012
0          계  49,540  49,773  50,515  50,734  50,948
1         서울  10,201  10,208  10,312  10,250  10,195
2         부산   3,565   3,543   3,568   3,551   3,538
3         대구   2,493   2,489   2,512   2,508   2,506
4         인천   2,693   2,710   2,758   2,801   2,844

In [4]:
korea_2017 = pd.read_excel('korea_pop_2017.xls',encoding='cp949')

In [5]:
korea_2017.head()

  Unnamed: 0    2013    2014    2015    2016    2017
0          계  51,141  51,328  51,529  51,696  51,778
1         서울  10,144  10,103  10,022   9,930   9,857
2         부산   3,528   3,519   3,513   3,498   3,470
3         대구   2,502   2,493   2,487   2,484   2,475
4         인천   2,880   2,903   2,925   2,943   2,948

In [6]:
korea_2017.index == korea_2012.index

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True])

In [7]:
korea_pop = pd.merge(korea_2012, korea_2017, left_index=True, right_index=True)

In [8]:
korea_pop.get_dtype_counts()

object    12
dtype: int64

In [9]:
korea_pop.shape

(18, 12)

In [10]:
for i in range(0,18) :
    a = korea_pop.iloc[i].str.replace(',','') #암시적으로 순서대로 교체한다.
    korea_pop.iloc[i] = a #행으로 시리즈로 만들어져서 다시 넣어져서 데이터프레임으로 형성된다.

In [11]:
 korea_pop.head()

,Unnamed: 0_x,2008,2009,2010,2011,2012,Unnamed: 0_y,2013,2014,2015,2016,2017
0,계,49540,49773,50515,50734,50948,계,51141,51328,51529,51696,51778
1,서울,10201,10208,10312,10250,10195,서울,10144,10103,10022,9930,9857
2,부산,3565,3543,3568,3551,3538,부산,3528,3519,3513,3498,3470
3,대구,2493,2489,2512,2508,2506,대구,2502,2493,2487,2484,2475
4,인천,2693,2710,2758,2801,2844,인천,2880,2903,2925,2943,2948

In [12]:
korea_pop.get_dtype_counts()

object    12
dtype: int64

In [13]:
korea_pop.isnull().sum()

Unnamed: 0_x    0
2008            0
2009            0
2010            0
2011            0
2012            0
Unnamed: 0_y    0
2013            0
2014            0
2015            0
2016            0
2017            0
dtype: int64

In [14]:
for i in range(0,18) :
    a = korea_pop.iloc[i].str.replace('-','NaN')
    korea_pop.iloc[i] = a

In [15]:
korea_pop = korea_pop.astype('float64') #NAN같은 경우에는 NP.NAN으로 바뀐다. 그래서 실제 정수 입력이 가능하다.

ValueError: could not convert string to float: '계'

In [ ]:
korea_pop.head(9)

In [ ]:
korea_pop.isnull().sum()

In [ ]:
korea_pop = korea_pop.fillna(0)

In [ ]:
korea_pop.head(9)

In [ ]:
korea_pop = korea_pop.astype('int64')

In [ ]:
korea_pop.head(9)

In [ ]:
korea_pop = korea_pop.drop(["계"],axis=0)

In [ ]:
korea_pop.head()

## 예제 6-5  조인문장 비교하기

In [ ]:
import numpy as np

In [ ]:
df1 = pd.DataFrame({'키': ['봄', '여름', '가을', '겨울'],
                    '값': np.random.randn(4)})

In [ ]:
df2 = pd.DataFrame({'키': ['여름', '겨울', '겨울', '기타'],
                   '값': np.random.randn(4)})

SELECT *
FROM df1
INNER JOIN df2
  ON df1.key = df2.key;

In [ ]:
 pd.merge(df1, df2, on='키') #키 기준 중복값만

In [ ]:
 pd.merge(korea_2012, korea_2017, left_index=True, right_index=True).head()

SELECT *
FROM df1
LEFT OUTER JOIN df2
  ON df1.key = df2.key;

In [ ]:
pd.merge(df1, df2, on='키', how='left') #JOIN의 방법.265P

SELECT *
FROM df1
RIGHT OUTER JOIN df2
  ON df1.key = df2.key;

In [ ]:
pd.merge(df1, df2, on='키', how='right')

SELECT *
FROM df1
FULL OUTER JOIN df2
  ON df1.key = df2.key;

In [ ]:
pd.merge(df1, df2, on='키', how='outer')

SELECT city, rank
FROM df1
UNION ALL
SELECT city, rank
FROM df2;

In [ ]:
pd.concat([df1, df2])

SELECT city, rank
FROM df1
UNION
SELECT city, rank
FROM df2;

In [ ]:
df2.loc[1] = df1.loc[3]#중복된 값을 가지게 만들기 위해 대입

In [ ]:
pd.concat([df1, df2]).drop_duplicates() #중복값 제거

## 예제 6-6  조건식을 이용해서 처리하기

In [ ]:
korea_2018 = pd.read_excel('factory_reg_2018.xlsx',
                           sheet_name=2, #엑셀 내의 시트를 정한다.
                           header=[2,3], 
                           encoding='cp949')

In [ ]:
korea_2018.head()

In [ ]:
korea_2018.tail()

In [ ]:
korea_2018.info()

In [ ]:
korea_2018.shape

In [ ]:
korea_2018 = korea_2018.dropna()

In [ ]:
korea_2018.shape

In [ ]:
korea_2018.tail()

In [ ]:
korea_2018.get_dtype_counts()

In [ ]:
korea_2018 = korea_2018.astype('int64')

In [ ]:
korea_2018.get_dtype_counts()

In [ ]:
korea_2018.columns.levels[0] #멀티인덱스 1레벨

In [ ]:
korea_2018.columns.levels[1] #멀티인덱스 2레벨

In [ ]:
korea_2018.columns = ['서울','부산','대구','인천','광주','대전','울산','세종',
                      '경기','강원','충북','충남','전북','전남','경북','경남','제주','합계']

In [ ]:
korea_2018.head()

In [ ]:
korea_2018[['서울', '제주']].head() #데이터프레임을 상대로 펜시 검색 이후 나오는 것은 데이터 프레임.

In [ ]:
korea_2018.columns.isin(['서울','제주'])

In [ ]:
korea_2018_서울_제주 = korea_2018.iloc[:,korea_2018.columns.isin(['서울','제주'])] # :만 들어가면 처음부터 끝까지

In [ ]:
korea_2018_서울_제주.head()

In [ ]:
korea_2018_서울_제주.서울.between(10, 20).sum() #맞는 행 번호를 도출한다. (시리즈)

In [ ]:
korea_2018_서울_제주.loc[korea_2018_서울_제주.서울.between(10, 20),'서울']#번호를 도출하기때문에 행 번호 적는 자리에 비트윈 때려넣음.

In [ ]:
korea_2018.query('서울 >=10 & 서울 <= 20')

In [ ]:
korea_2018.query('서울 >=10 & 서울 <= 20')['서울']

In [ ]:
korea_2018.query('서울 >=10 & 서울 <= 20')[['서울']]

In [ ]:
mm = 10

In [ ]:
nn = 20

In [ ]:
qs1 = "@mm <= 서울 <= @nn "

In [ ]:
korea_2018.query(qs1)[['서울']]

## 예제 6-7  추가적인 조건절 처리 메소드

In [ ]:
korea_2018.where(korea_2018['서울'] < 30).head()

In [ ]:
korea_2018.where(korea_2018['서울'] < 30, 0.0).head()

In [ ]:
korea_2018.mask(korea_2018['서울'] < 30).head()

In [ ]:
korea_2018.mask(korea_2018['서울'] < 30, 0.0).head()

In [ ]:
korea_2018.take([0],axis=0)

In [ ]:
korea_2018.take([0],axis=1).head()

In [ ]:
korea_2018.take([0,3,5],axis=1).head()

## 예제 6-8  sql 문장과 비교하기

SELECT 서울, 인천, 대전 
FROM korea_2018
LIMIT 5;

In [ ]:
korea_2018[['서울', '인천', '대전']].head(5) #sql대신 데이터프레임으로 끌고와 사용하는 방법

SELECT *
FROM korea_2018
WHERE 서울 = 41
LIMIT 5;

In [ ]:
korea_2018[korea_2018['서울'] == 41 ].head(5)

In [ ]:
is_41 = korea_2018['서울'] == 41

In [ ]:
is_41.value_counts()

In [ ]:
korea_2018[is_41].head(5)

SELECT *
FROM korea_2018
WHERE 서울 < 41 & 제주 > 5
LIMIT 5;

In [ ]:
korea_2018[(korea_2018['서울'] < 41) &  (korea_2018['제주'] > 0)]

In [ ]:
book_data = pd.read_csv("../data/book_data.csv",encoding='cp949')

In [ ]:
book_data.head()

In [ ]:
book_filter = book_data.filter(like="book")

In [ ]:
book_filter.head()

In [ ]:
###########download - db browser for sqlite

In [ ]:
#위의 프로그램과 같이 sqlite3 파이썬 연동 사용해보기